In [167]:
import pandas as pd
import numpy as np

school_data = '../Starter_Code/PyCitySchools/Resources/schools_complete.csv'
student_data = '../Starter_Code/PyCitySchools/Resources/students_complete.csv'

school_data = pd.read_csv(school_data)
student_data = pd.read_csv(student_data)

school_data_all = pd.merge(student_data, school_data, how = "left", on = ["school_name", "school_name"])
school_data_all.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

## District Summary

In [168]:
# Calculate the total number of unique schools
school_count = len(school_data)
school_count

15

In [169]:
# Calculate the total number of students
student_count = len(student_data)
student_count

39170

In [170]:
# Calculate the total budget
total_budget = sum(school_data['budget'])
total_budget

24649428

In [171]:
# Calculate the average (mean) math score
average_math_score = np.mean(student_data['math_score'])
average_math_score

78.98537145774827

In [172]:
# Calculate the average (mean) reading score
average_reading_score = np.mean(student_data['reading_score'])
average_reading_score

81.87784018381414

In [173]:
passing_math_count = student_data[(student_data['math_score'])>=70].count()['student_name']
passing_math_percentage = (passing_math_count/student_count)*100
passing_math_percentage

74.9808526933878

In [174]:
passing_reading_count = student_data[(student_data['reading_score'])>=70].count()['student_name']
passing_reading_percentage = (passing_reading_count/student_count)*100
passing_reading_percentage

85.80546336482001

In [175]:
passing_math_reading_count = student_data[((student_data['math_score'])>=70) & ((student_data['reading_score'])>=70)].count()['student_name']
passing_math_reading_percentage = (passing_math_reading_count/student_count)*100
passing_math_reading_percentage

65.17232575950983

In [176]:
#Create a hith-level snapshot of the district's key metrics in a DataFrame
district_summary = {
    'Total Schools': [school_count],
    'Total Students': [student_count],
    'Total Budget': [total_budget],
    'Average Math Score': [average_math_score],
    'Average Reading Score': [average_reading_score],
    '% Passing Math': [passing_math_percentage],
    '% Passing Reading': [passing_reading_percentage],
    '% Overall Passing': [passing_math_reading_percentage]
}

district_summary = pd.DataFrame(district_summary)

# Formatting
district_summary["Total Students"] = district_summary["Total Students"].map("{:,}".format)
district_summary["Total Budget"] = district_summary["Total Budget"].map("${:,.2f}".format)

district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",78.985371,81.87784,74.980853,85.805463,65.172326

## School Summary

In [177]:
school_types = school_data[['school_name', 'type']]
pd.DataFrame(school_types)

              school_name      type
0       Huang High School  District
1    Figueroa High School  District
2     Shelton High School   Charter
3   Hernandez High School  District
4     Griffin High School   Charter
5      Wilson High School   Charter
6     Cabrera High School   Charter
7      Bailey High School  District
8      Holden High School   Charter
9        Pena High School   Charter
10     Wright High School   Charter
11  Rodriguez High School  District
12    Johnson High School  District
13       Ford High School  District
14     Thomas High School   Charter

In [178]:
# Calculate the total student count per school
per_school_counts = school_data_all.groupby('school_name')['student_name'].count()
pd.DataFrame(per_school_counts)

                       student_name
school_name
Bailey High School             4976
Cabrera High School            1858
Figueroa High School           2949
Ford High School               2739
Griffin High School            1468
Hernandez High School          4635
Holden High School              427
Huang High School              2917
Johnson High School            4761
Pena High School                962
Rodriguez High School          3999
Shelton High School            1761
Thomas High School             1635
Wilson High School             2283
Wright High School             1800

In [179]:
# Calculate the total school budget and per capita spending per school
per_school_budget = school_data_all.groupby('school_name')['budget'].sum()
per_school_capita = per_school_budget/per_school_counts
pd.DataFrame(per_school_capita)

                               0
school_name
Bailey High School     3124928.0
Cabrera High School    1081356.0
Figueroa High School   1884411.0
Ford High School       1763916.0
Griffin High School     917500.0
Hernandez High School  3022020.0
Holden High School      248087.0
Huang High School      1910635.0
Johnson High School    3094650.0
Pena High School        585858.0
Rodriguez High School  2547363.0
Shelton High School    1056600.0
Thomas High School     1043130.0
Wilson High School     1319574.0
Wright High School     1049400.0

In [180]:
# Calculate the average test scores per school
per_school_math = school_data_all.groupby('school_name')['math_score'].mean()
per_school_reading = school_data_all.groupby('school_name')['reading_score'].mean()

In [181]:
students_passing_math = school_data_all['math_score']>=70
school_students_passing_math = school_data_all[students_passing_math].groupby('school_name')['math_score'].count()
pd.DataFrame(school_students_passing_math)

                       math_score
school_name
Bailey High School           3318
Cabrera High School          1749
Figueroa High School         1946
Ford High School             1871
Griffin High School          1371
Hernandez High School        3094
Holden High School            395
Huang High School            1916
Johnson High School          3145
Pena High School              910
Rodriguez High School        2654
Shelton High School          1653
Thomas High School           1525
Wilson High School           2143
Wright High School           1680

In [182]:
students_passing_reading = school_data_all['reading_score']>=70
school_students_passing_reading = school_data_all[students_passing_reading].groupby('school_name')['reading_score'].count()
pd.DataFrame(school_students_passing_reading)

                       reading_score
school_name
Bailey High School              4077
Cabrera High School             1803
Figueroa High School            2381
Ford High School                2172
Griffin High School             1426
Hernandez High School           3748
Holden High School               411
Huang High School               2372
Johnson High School             3867
Pena High School                 923
Rodriguez High School           3208
Shelton High School             1688
Thomas High School              1591
Wilson High School              2204
Wright High School              1739

In [183]:
students_passing_math_and_reading = school_data_all[
    (school_data_all["reading_score"] >= 70) & (school_data_all["math_score"] >= 70)
]
school_students_passing_math_and_reading = students_passing_math_and_reading.groupby(["school_name"]).size()
pd.DataFrame(school_students_passing_math_and_reading)

                          0
school_name
Bailey High School     2719
Cabrera High School    1697
Figueroa High School   1569
Ford High School       1487
Griffin High School    1330
Hernandez High School  2481
Holden High School      381
Huang High School      1561
Johnson High School    2549
Pena High School        871
Rodriguez High School  2119
Shelton High School    1583
Thomas High School     1487
Wilson High School     2068
Wright High School     1626

In [184]:
# Use the provided code to calculate the passing rates
per_school_passing_math = school_students_passing_math / per_school_counts * 100
per_school_passing_reading = school_students_passing_reading / per_school_counts * 100
overall_passing_rate = school_students_passing_math_and_reading / per_school_counts * 100
pd.DataFrame(overall_passing_rate)

                               0
school_name
Bailey High School     54.642283
Cabrera High School    91.334769
Figueroa High School   53.204476
Ford High School       54.289887
Griffin High School    90.599455
Hernandez High School  53.527508
Holden High School     89.227166
Huang High School      53.513884
Johnson High School    53.539172
Pena High School       90.540541
Rodriguez High School  52.988247
Shelton High School    89.892107
Thomas High School     90.948012
Wilson High School     90.582567
Wright High School     90.333333

In [185]:
per_school_summary = {#'School Type': school_types, 
                           'Total Students': per_school_counts, 
                           'Total School Budget': per_school_budget, 
                           'Per Student Budget': per_school_capita, 
                           'Average Math Score': per_school_math, 
                           'Average Reading Score': per_school_reading, 
                           '% Passing Math': per_school_passing_math, 
                           '% Passing Reading': per_school_passing_reading, 
                           '% Overall Passing': overall_passing_rate
}

pd.DataFrame(per_school_summary)

,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
school_name,,,,,,,,
Bailey High School,4976,15549641728,3124928.0,77.048432,81.033963,66.680064,81.933280,54.642283
Cabrera High School,1858,2009159448,1081356.0,83.061895,83.975780,94.133477,97.039828,91.334769
Figueroa High School,2949,5557128039,1884411.0,76.711767,81.158020,65.988471,80.739234,53.204476
Ford High School,2739,4831365924,1763916.0,77.102592,80.746258,68.309602,79.299014,54.289887
Griffin High School,1468,1346890000,917500.0,83.351499,83.816757,93.392371,97.138965,90.599455
Hernandez High School,4635,14007062700,3022020.0,77.289752,80.934412,66.752967,80.862999,53.527508
Holden High School,427,105933149,248087.0,83.803279,83.814988,92.505855,96.252927,89.227166
Huang High School,2917,5573322295,1910635.0,76.629414,81.182722,65.683922,81.316421,53.513884
Johnson High School,4761,14733628650,3094650.0,77.072464,80.966394,66.057551,81.222432,53.539172
Pena High School,962,563595396,585858.0,83.839917,84.044699,94.594595,95.945946,90.540541
Rodriguez High School,3999,10186904637,2547363.0,76.842711,80.744686,66.366592,80.220055,52.988247
Shelton High School,1761,1860672600,1056600.0,83.359455,83.725724,93.867121,95.854628,89.892107
Thomas High School,1635,1705517550,1043130.0,83.418349,83.848930,93.272171,97.308869,90.948012
Wilson High School,2283,3012587442,1319574.0,83.274201,83.989488,93.867718,96.539641,90.582567
Wright High School,1800,1888920000,1049400.0,83.682222,83.955000,93.333333,96.611111,90.333333

## Highest-Performing Schools (by % Overall Passing)

In [186]:
# Sort the schools by `% Overall Passing` in descending order and display the top 5 rows.
top_schools = overall_passing_rate.sort_values(ascending=False)
top_schools = pd.DataFrame(top_schools)
top_schools.head(5)

                             0
school_name
Cabrera High School  91.334769
Thomas High School   90.948012
Griffin High School  90.599455
Wilson High School   90.582567
Pena High School     90.540541

## Bottom Performing Schools (By % Overall Passing)

In [187]:
bottom_schools = overall_passing_rate.sort_values(ascending=True)
bottom_schools = pd.DataFrame(bottom_schools)
bottom_schools.head(5)

                               0
school_name
Rodriguez High School  52.988247
Figueroa High School   53.204476
Huang High School      53.513884
Hernandez High School  53.527508
Johnson High School    53.539172

## Math Scores by Grade

In [200]:
ninth_graders = school_data_all[(school_data_all['grade']=='9th')]
tenth_graders = school_data_all[(school_data_all['grade']=='10th')]
eleventh_graders = school_data_all[(school_data_all['grade']=='11th')]
twelfth_graders = school_data_all[(school_data_all['grade']=='12th')]

# Group by `school_name` and take the mean of the `math_score` column for each.
ninth_grade_math_scores = ninth_graders.groupby('school_name')['math_score'].mean()
tenth_grader_math_scores = tenth_graders.groupby('school_name')['math_score'].mean()
eleventh_grader_math_scores = eleventh_graders.groupby('school_name')['math_score'].mean()
twelfth_grader_math_scores = twelfth_graders.groupby('school_name')['math_score'].mean()

ninth_grade_math_scores = pd.DataFrame(ninth_grade_math_scores).rename(columns = {'math_score':'9th grade math score'})
tenth_grader_math_scores = pd.DataFrame(tenth_grader_math_scores).rename(columns = {'math_score':'10th grade math score'})
eleventh_grader_math_scores = pd.DataFrame(eleventh_grader_math_scores).rename(columns = {'math_score':'11th grade math score'})
twelfth_grader_math_scores = pd.DataFrame(twelfth_grader_math_scores).rename(columns = {'math_score':'12th grade math score'})

math_scores_by_grade = pd.merge(ninth_grade_math_scores, tenth_grader_math_scores, on = 'school_name')
math_scores_by_grade = pd.merge(math_scores_by_grade, eleventh_grader_math_scores, on = 'school_name')
math_scores_by_grade = pd.merge(math_scores_by_grade, twelfth_grader_math_scores, on = 'school_name')
math_scores_by_grade

,9th grade math score,10th grade math score,11th grade math score,12th grade math score
school_name,,,,
Bailey High School,77.083676,76.996772,77.515588,76.492218
Cabrera High School,83.094697,83.154506,82.765560,83.277487
Figueroa High School,76.403037,76.539974,76.884344,77.151369
Ford High School,77.361345,77.672316,76.918058,76.179963
Griffin High School,82.044010,84.229064,83.842105,83.356164
Hernandez High School,77.438495,77.337408,77.136029,77.186567
Holden High School,83.787402,83.429825,85.000000,82.855422
Huang High School,77.027251,75.908735,76.446602,77.225641
Johnson High School,77.187857,76.691117,77.491653,76.863248
Pena High School,83.625455,83.372000,84.328125,84.121547
Rodriguez High School,76.859966,76.612500,76.395626,77.690748
Shelton High School,83.420755,82.917411,83.383495,83.778976
Thomas High School,83.590022,83.087886,83.498795,83.497041
Wilson High School,83.085578,83.724422,83.195326,83.035794
Wright High School,83.264706,84.010288,83.836782,83.644986

In [201]:
ninth_graders = school_data_all[(school_data_all['grade']=='9th')]
tenth_graders = school_data_all[(school_data_all['grade']=='10th')]
eleventh_graders = school_data_all[(school_data_all['grade']=='11th')]
twelfth_graders = school_data_all[(school_data_all['grade']=='12th')]

# Group by `school_name` and take the mean of the `reading_score` column for each.
ninth_grade_reading_scores = ninth_graders.groupby('school_name')['reading_score'].mean()
tenth_grader_reading_scores = tenth_graders.groupby('school_name')['reading_score'].mean()
eleventh_grader_reading_scores = eleventh_graders.groupby('school_name')['reading_score'].mean()
twelfth_grader_reading_scores = twelfth_graders.groupby('school_name')['reading_score'].mean()

ninth_grade_reading_scores = pd.DataFrame(ninth_grade_reading_scores).rename(columns = {'reading_score':'9th grade reading score'})
tenth_grader_reading_scores = pd.DataFrame(tenth_grader_reading_scores).rename(columns = {'reading_score':'10th grade reading score'})
eleventh_grader_reading_scores = pd.DataFrame(eleventh_grader_reading_scores).rename(columns = {'reading_score':'11th grade reading score'})
twelfth_grader_reading_scores = pd.DataFrame(twelfth_grader_reading_scores).rename(columns = {'reading_score':'12th grade reading score'})

reading_scores_by_grade = pd.merge(ninth_grade_reading_scores, tenth_grader_reading_scores, on = 'school_name')
reading_scores_by_grade = pd.merge(reading_scores_by_grade, eleventh_grader_reading_scores, on = 'school_name')
reading_scores_by_grade = pd.merge(reading_scores_by_grade, twelfth_grader_reading_scores, on = 'school_name')
reading_scores_by_grade

,9th grade reading score,10th grade reading score,11th grade reading score,12th grade reading score
school_name,,,,
Bailey High School,81.303155,80.907183,80.945643,80.912451
Cabrera High School,83.676136,84.253219,83.788382,84.287958
Figueroa High School,81.198598,81.408912,80.640339,81.384863
Ford High School,80.632653,81.262712,80.403642,80.662338
Griffin High School,83.369193,83.706897,84.288089,84.013699
Hernandez High School,80.866860,80.660147,81.396140,80.857143
Holden High School,83.677165,83.324561,83.815534,84.698795
Huang High School,81.290284,81.512386,81.417476,80.305983
Johnson High School,81.260714,80.773431,80.616027,81.227564
Pena High School,83.807273,83.612000,84.335938,84.591160
Rodriguez High School,80.993127,80.629808,80.864811,80.376426
Shelton High School,84.122642,83.441964,84.373786,82.781671
Thomas High School,83.728850,84.254157,83.585542,83.831361
Wilson High School,83.939778,84.021452,83.764608,84.317673
Wright High School,83.833333,83.812757,84.156322,84.073171

## Scores by School Spending

In [ ]:
# Establish the bins 
spending_bins = [0, 585, 630, 645, 680]
labels = ["<$585", "$585-630", "$630-645", "$645-680"]

In [ ]:
school_spending_df = per_school_summary.copy()

In [ ]:
school_data_all.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635